[
  {
    "id": "2512.24844v1",
    "title": "Influence of Centre Body on the Dynamics of Isothermal Flow Swirl Combustor",
    "authors": "Ratnesh Pathak, Nitesh Kumar Sahu, Pradeep Kumar Sonkar",
    "abstract": "This study examines the effect of centre-body geometry on the dynamics of an isothermal, non-reacting swirl combustor through computational fluid dynamics (CFD) simulations. Two different central body shapes were considered in a lab-scale combustor configuration, modelled as transient, incompressible flow using the SST k-omega turbulence model. The numerical model was validated against experimental velocity data from literature to ensure accuracy. Cross-spectral analysis techniques were employed to characterise the coherent dynamics of the flow, providing insight into the influence of geometry on unsteady swirl dynamics.",
    "published": "2025-12-31",
    "arxiv_url": "http://arxiv.org/abs/2512.24844v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24844v1",
    "categories": [
      "physics.flu-dyn"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "CFD与机器学习交叉",
      "智能流体力学",
      "流体力学"
    ],
    "keywords": [
      "rans",
      "rom",
      "computational fluid dynamics",
      "turbulence",
      "cfd",
      "fluid dynamics"
    ]
  },
  {
    "id": "2512.24813v1",
    "title": "Learning Temporally Consistent Turbulence Between Sparse Snapshots via Diffusion Models",
    "authors": "Mohammed Sardar, Małgorzata J. Zimoń, Samuel Draycott, Alistair Revell, Alex Skillen",
    "abstract": "We investigate the statistical accuracy of temporally interpolated spatiotemporal flow sequences between sparse, decorrelated snapshots of turbulent flow fields using conditional Denoising Diffusion Probabilistic Models (DDPMs). The developed method is presented as a proof-of-concept generative surrogate for reconstructing coherent turbulent dynamics between sparse snapshots, demonstrated on a 2D Kolmogorov Flow, and a 3D Kelvin-Helmholtz Instability (KHI). We analyse the generated flow sequences through the lens of statistical turbulence, examining the time-averaged turbulent kinetic energy spectra over generated sequences, and temporal decay of turbulent structures. For the non-stationary Kelvin-Helmholtz Instability, we assess the ability of the proposed method to capture evolving flow statistics across the most strongly time-varying flow regime. We additionally examine instantaneous fields and physically motivated metrics at key stages of the KHI flow evolution.",
    "published": "2025-12-31",
    "arxiv_url": "http://arxiv.org/abs/2512.24813v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24813v1",
    "categories": [
      "physics.flu-dyn",
      "cs.LG"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "流体力学"
    ],
    "keywords": [
      "turbulence"
    ]
  },
  {
    "id": "2512.24757v1",
    "title": "Generalization Capability of Deep Learning for Predicting Drag Reduction in Pulsating Turbulent Pipe Flow with Arbitrary Acceleration and Deceleration",
    "authors": "Sota Kumazawa, Yasuhiro Yoshida, Tomohiro Nimura, Akira Murata, Kaoru Iwamoto",
    "abstract": "The spatiotemporal evolution of pulsating turbulent pipe flow was predicted by deep learning. A convolutional neural network (CNN) and long short-term memory (LSTM) were employed for long-term prediction by recursively predicting the local temporal evolution. To enhance prediction, physical components such as wall shear stress were informed into the training process. The datasets were obtained from direct numerical simulation (DNS). The model was trained exclusively on a limited set of sinusoidal pulsating flows driven by pressure gradients defined by their period and amplitude. Subsequently, 36 pulsating flows with arbitrary non-sinusoidal acceleration and deceleration were predicted to evaluate the generalization capability, defined as the predictive performance on unseen data during training. The model successfully predicted drag reduction rates ranging from $-1\\%$ to $86\\%$, with a mean absolute error of 9.2. This predictive performance for unseen pulsations indicates that local temporal prediction plays a central role, rather than learning the global profile of the pulsating waveforms. This implication was quantitatively verified by analyzing the differences in periodic $C_f$--$Re_b$ trajectories between the training and test datasets, demonstrating that flows exhibiting local similarity to the training data are more predictable. Furthermore, it was demonstrated that flows exhibiting intermittent laminar--turbulent transition and relaminarization become predictable when such regimes are incorporated into the training data. The results indicate that accurate prediction is achievable provided that the training data sufficiently cover the local flow-state space, highlighting the importance of appropriate training data selection for generalized flow prediction.",
    "published": "2025-12-31",
    "arxiv_url": "http://arxiv.org/abs/2512.24757v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24757v1",
    "categories": [
      "physics.flu-dyn"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "智能流体力学",
      "机器学习"
    ],
    "keywords": [
      "rans",
      "rom",
      "cnn",
      "deep learning",
      "neural network",
      "lstm",
      "dns"
    ]
  },
  {
    "id": "2512.24469v1",
    "title": "Beyond chaos: fluctuations, anomalies and spontaneous stochasticity in fluid turbulence",
    "authors": "Gregory L. Eyink, Nigel Goldenfeld",
    "abstract": "In this perspective, we consider the development of statistical hydrodynamics, focusing on the way in which the intrinsic stochasticity of turbulent phenomena was identified and is being explored. A major purpose of our discussion is to bring out the role of anomalies in turbulent phenomena, in ways that are not usually done, and to emphasize how the description of turbulent phenomena requires delicate considerations of asymptotic limits. The scope of our narrative includes selected historical aspects that are not usually emphasized, primarily due to G.I. Taylor, as well as discussions of certain aspects of the laminar-turbulent transition, the behaviour of turbulent drag at intermediate Reynolds numbers, and the statistics of fully-developed turbulence that exhibit spontaneous stochasticity.",
    "published": "2025-12-30",
    "arxiv_url": "http://arxiv.org/abs/2512.24469v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24469v1",
    "categories": [
      "physics.flu-dyn",
      "cond-mat.stat-mech",
      "nlin.CD"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "流体力学"
    ],
    "keywords": [
      "turbulence",
      "rans"
    ]
  },
  {
    "id": "2512.24168v1",
    "title": "Turbulence enhances bird tail aerodynamic performance",
    "authors": "Ariane Gayout, David Lentink",
    "abstract": "Turbulence is omnipresent in the atmosphere and a long-standing scientific conundrum that makes flight complex. This complexity is little understood; surprisingly, when turbulence arises, air vehicles struggle while birds seem to thrive. Birds often encounter intense turbulence during takeoff and landing, because of turbulent boundary layer effects. During landing, birds respond by fanning their tail over a wide range of spreads and angles of attack. How their tail functions aerodynamically under these conditions is little understood. Here, we use a bio-hybrid feathered robot model of a pigeon tail in a wind tunnel to compare its aerodynamics in laminar versus turbulent flow. We measured the lift and drag forces generated by the tail as a function of angle of attack, tail spread, and flow condition. We found tail spread scarcely changes tail aerodynamic lift and drag force coefficients, despite large aspect ratio variations. Consequently, tail spread primarily changes force via tail area modulation, simplifying flight control. The effect of laminar versus turbulent flow is pronounced; at the same tail spread and angle of attack, turbulence increases lift and drag by approximately a factor two. Quantitative flow measurement analysis with proper orthogonal decomposition shows force enhancement is linked to modifications in the spatial and temporal structure of the wake. The results suggest a wake instability that arises in laminar flow is suppressed in turbulent flow, which enhances tail efficiency, benefiting flight control. These insights may inspire engineers to design aerial vehicle tails with improved flight control in turbulence.",
    "published": "2025-12-30",
    "arxiv_url": "http://arxiv.org/abs/2512.24168v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24168v1",
    "categories": [
      "physics.flu-dyn"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "流体力学",
      "空气动力学"
    ],
    "keywords": [
      "turbulence",
      "les",
      "aerodynamics"
    ]
  },
  {
    "id": "2512.23991v2",
    "title": "Towards Quantum Machine Learning of Lattice Boltzmann Collision Operators for Fluid Dynamic Simulations",
    "authors": "Wael Itani, Katepalli R. Sreenivasan",
    "abstract": "We attempt the use of a unitary operator to approximate the lattice Boltzmann collision operator. We use a modified amplitude encoding to bypass the renormalization that would have required classical processing at every step (thus eroding any quantum advantage to be had). We describe the hard-wiring of the lattice Boltzmann symmetries into the quantum circuit and show that, for the specific case of the cavity flow, approximating the nonlinear system is limited to low velocities. These findings may help us understand better the possibilities of nonlinear simulations on a quantum computer, and also pave the way for a discussion on how quantum machine learning might be harnessed to address more complex problems.",
    "published": "2025-12-30",
    "arxiv_url": "http://arxiv.org/abs/2512.23991v2",
    "pdf_url": "https://arxiv.org/pdf/2512.23991v2",
    "categories": [
      "quant-ph",
      "physics.flu-dyn"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "智能流体力学",
      "机器学习"
    ],
    "keywords": [
      "machine learning"
    ]
  },
  {
    "id": "2512.23893v1",
    "title": "Turbulence Kinetic Energy Distribution and Heat Transfer in a Porous Layer Induced by Bluff Body Vortex Shedding",
    "authors": "Thibaut K Kemayo, Justin Courter, Vishal Srikanth, Chadwick Jetti, Andrey V Kuznetsov",
    "abstract": "When a turbulent vortex impinges on a porous layer, it creates a complex multiscale interaction: the wake structures that form in the free fluid engage with the intricate geometry of the pores, and this interplay governs both the turbulent energy budget and the rate of heat transfer. Here we use interface-resolved two-dimensional direct numerical simulations (DNS) to examine how a bluff-body wake impinges on an in-line porous array heated to maintain a constant wall temperature. The Reynolds number is fixed at Re = 10000, and the porosity is varied between $φ$ = 0.80 and $φ$ = 0.95. In all cases, the incoming von Karman vortices undergo rapid breakdown at the porous/fluid interface and do not persist as coherent macroscale structures within the porous layer. The interface instead acts as a spectral filter: large-scale wake energy is strongly attenuated, while turbulence is regenerated locally within the matrix via shear layers and microscale vortex shedding around individual obstacles. Thermal statistics show that the lower-porosity medium produces higher local and surface-averaged Nusselt numbers across representative interface and interior locations. This is consistent with the stronger shear and enhanced fluid/solid thermal interaction associated with the larger surface-area-to-volume ratio. These results clarify the mechanisms by which wake-driven turbulence is converted into pore-scale motions and how porosity tunes the balance between turbulence attenuation and convective heat transfer in porous coatings and inserts.",
    "published": "2025-12-29",
    "arxiv_url": "http://arxiv.org/abs/2512.23893v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23893v1",
    "categories": [
      "physics.flu-dyn"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "流体力学"
    ],
    "keywords": [
      "turbulence",
      "rans",
      "dns",
      "les"
    ]
  },
  {
    "id": "2512.23116v1",
    "title": "Validating the Boltzmann approach to the Large-Eddy simulations of forced homogeneous incompressible turbulence",
    "authors": "Muhammad Idrees Khan, Sauro Succi, Giacomo Falcucci",
    "abstract": "The simulation of turbulent flows remains a central challenge, as even our most powerful computers cannot resolve the finest scales of motion in many flows of practical interest. As a result, the effects of unresolved scales on large eddies must be modelled via closures and coarse-graining procedures. Large-eddy simulation (LES) traditionally coarse-grains Navier-Stokes equations using Smagorinsky's effective viscosity model. This has the merit of simplicity but fails to account for strong non-equilibrium effects, as they typically arise in most flows in the vicinity of solid walls, the reason being that the notion of eddy viscosity assumes scale separation between small and large eddies, an assumption that fails for high-Reynolds flows far from equilibrium. The lattice Boltzmann method (LBM) offers an alternative by coarse-graining at the kinetic level, potentially capturing non-equilibrium effects beyond reach of hydrodynamic closures. This paper addresses whether LBM-Smagorinsky LES of forced homogeneous isotropic turbulence (FHIT) exhibits kinetic behavior. We test whether the turbulent Knudsen number $K_t$, measuring scale separation, reaches order one (kinetic regime) or remains asymptotically small (hydrodynamic regime). Using reference DNS ($800^3$) and iso-Reynolds LES ($100^3$) at $Re = 2 \\times 10^4$, we quantify $K_t$ via spatial maps, temporal statistics, energy spectra, and higher-order moments. Results show $K_t \\sim O(10^{-3})$, strictly positive without negative excursions, with spectra and flatness following canonical LES behavior. We conclude that despite its kinetic formulation, LBM-Smagorinsky LES operates in the hydrodynamic regime, with small FHIT eddies remaining in local equilibrium with larger ones, validating Smagorinsky viscosity and confirming that LBM-LES functions as conventional hydrodynamic LES while preserving LBM efficiency and locality.",
    "published": "2025-12-28",
    "arxiv_url": "http://arxiv.org/abs/2512.23116v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23116v1",
    "categories": [
      "physics.flu-dyn"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "CFD与机器学习交叉",
      "流体力学"
    ],
    "keywords": [
      "turbulence",
      "dns",
      "les",
      "rom"
    ]
  },
  {
    "id": "2512.22994v1",
    "title": "An efficient eigenvalue bounding method: CFL condition revisited",
    "authors": "F. Xavier Trias, Xavier Álvarez-Farré, Àdel Alsalti-Baldellou, Andrey Gorobets, Assensi Oliva",
    "abstract": "Direct and large-eddy simulations of turbulence are often solved using explicit temporal schemes. However, this imposes very small time-steps because the eigenvalues of the (linearized) dynamical system, re-scaled by the time-step, must lie inside the stability region. In practice, fast and accurate estimations of the spectral radii of both the discrete convective and diffusive terms are therefore needed. This is virtually always done using the so-called CFL condition. On the other hand, the large heterogeneity and complexity of modern supercomputing systems are nowadays hindering the efficient cross-platform portability of CFD codes. In this regard, our leitmotiv reads: relying on a minimal set of (algebraic) kernels is crucial for code portability and maintenance! In this context, this work focuses on the computation of eigenbounds for the above-mentioned convective and diffusive matrices which are needed to determine the time-step à la CFL. To do so, a new inexpensive method, that does not require to re-construct these time-dependent matrices, is proposed and tested. It just relies on a sparse-matrix vector product where only vectors change on time. Hence, both implementation in existing codes and cross-platform portability are straightforward. The effectiveness and robustness of the method are demonstrated for different test cases on both structured Cartesian and unstructured meshes. Finally, the method is combined with a self-adaptive temporal scheme, leading to significantly larger time-steps compared with other more conventional CFL-based approaches.",
    "published": "2025-12-28",
    "arxiv_url": "http://arxiv.org/abs/2512.22994v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22994v1",
    "categories": [
      "physics.flu-dyn",
      "physics.comp-ph"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "流体力学"
    ],
    "keywords": [
      "turbulence",
      "cfd"
    ]
  },
  {
    "id": "2512.22717v1",
    "title": "A rational length scale for large-eddy simulation of turbulence on anisotropic grids",
    "authors": "F. Xavier Trias, Jesús Ruano, Alexey Duben, Andrey Gorobets",
    "abstract": "Due to the prohibitive cost of resolving all relevant scales, direct numerical simulations of turbulence remain unfeasible for most real-world applications. Consequently, dynamically simplified formulations are needed for coarse-grained simulations. In this regard, eddy-viscosity models for Large-Eddy Simulation (LES) are widely used both in academia and industry. These models require a subgrid characteristic length, typically linked to the local grid size. While this length scale corresponds to the mesh step for isotropic grids, its definition for unstructured or anisotropic Cartesian meshes, such as the pancake-like meshes commonly used to capture near-wall turbulence or shear layers, remains an open question. Despite its significant influence on LES model performance, no consensus has been reached on its proper formulation. In this work, we introduce a novel subgrid characteristic length. This length scale is derived from the analysis of the entanglement between the numerical discretization and the filtering in LES. Its mathematical properties and simplicity make it a robust choice for reducing the impact of mesh anisotropies on simulation accuracy. The effectiveness of the proposed subgrid length is demonstrated through simulations of decaying isotropic turbulence and a turbulent channel flow using different codes.",
    "published": "2025-12-27",
    "arxiv_url": "http://arxiv.org/abs/2512.22717v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22717v1",
    "categories": [
      "physics.flu-dyn",
      "physics.comp-ph"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "CFD与机器学习交叉",
      "流体力学"
    ],
    "keywords": [
      "turbulence",
      "rom",
      "les"
    ]
  },
  {
    "id": "2512.22644v1",
    "title": "On the Reynolds-number scaling of Poisson solver complexity",
    "authors": "F. Xavier Trias, Àdel Alsalti-Baldellou, Assensi Oliva",
    "abstract": "We aim to answer the following question: is the complexity of numerically solving the Poisson equation increasing or decreasing for very large simulations of incompressible flows? Physical and numerical arguments are combined to derive power-law scalings at very high Reynolds numbers. A theoretical convergence analysis for both Jacobi and multigrid solvers defines a two-dimensional phase space divided into two regions depending on whether the number of solver iterations tends to decrease or increase with the Reynolds number. Numerical results indicate that, for Navier-Stokes turbulence, the complexity decreases with increasing Reynolds number, whereas for the one-dimensional Burgers equation it follows the opposite trend. The proposed theoretical framework thus provides a unified perspective on how solver convergence scales with the Reynolds number and offers valuable guidance for the development of next-generation preconditioning and multigrid strategies for extreme-scale simulations.",
    "published": "2025-12-27",
    "arxiv_url": "http://arxiv.org/abs/2512.22644v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22644v1",
    "categories": [
      "physics.flu-dyn",
      "math-ph",
      "physics.comp-ph"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "流体力学"
    ],
    "keywords": [
      "turbulence",
      "les"
    ]
  },
  {
    "id": "2512.22559v1",
    "title": "Modeling Noise in Quantum Computing of Scalar Convection",
    "authors": "Jiahua Yang, Zhen Lu, Yue Yang",
    "abstract": "Quantum computing holds potential for accelerating the simulation of fluid dynamics. However, hardware noise in the noisy intermediate-scale quantum era significantly distorts simulation accuracy. Although error magnitudes are frequently quantified, the specific physical effects of quantum noise on flow simulation results remain largely uncharacterized. We investigate the influence of gate noise on the quantum simulation of one-dimensional scalar convection. By employing a quantum spectral algorithm where ideal time advancement affects only Fourier phases, we isolate and analyze noise-induced artifacts in spectral magnitudes. We derive a theoretical transition matrix based on Hamming distances between computational basis states to predict spectral decay, and then validate this model against density-matrix simulations and experiments on a superconducting quantum processor. Furthermore, using data-driven sparse regression, we demonstrate that quantum noise manifests in the effective partial differential equation primarily as artificial diffusion and nonlinear source terms. These findings suggest that quantum errors can be modeled as deterministic physical terms rather than purely stochastic perturbations.",
    "published": "2025-12-27",
    "arxiv_url": "http://arxiv.org/abs/2512.22559v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22559v1",
    "categories": [
      "quant-ph",
      "physics.flu-dyn"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "CFD与机器学习交叉",
      "智能流体力学",
      "流体力学"
    ],
    "keywords": [
      "flow simulation",
      "fluid dynamics",
      "rans",
      "data-driven"
    ]
  },
  {
    "id": "2512.22426v1",
    "title": "Uncertainty-Aware Flow Field Reconstruction Using SVGP Kolmogorov-Arnold Networks",
    "authors": "Y. Sungtaek Ju",
    "abstract": "Reconstructing time-resolved flow fields from temporally sparse velocimetry measurements is critical for characterizing many complex thermal-fluid systems. We introduce a machine learning framework for uncertainty-aware flow reconstruction using sparse variational Gaussian processes in the Kolmogorov-Arnold network topology (SVGP-KAN). This approach extends the classical foundations of Linear Stochastic Estimation (LSE) and Spectral Analysis Modal Methods (SAMM) while enabling principled epistemic uncertainty quantification. We perform a systematic comparison of our framework with the classical reconstruction methods as well as Kalman filtering. Using synthetic data from pulsed impingement jet flows, we assess performance across fractional PIV sampling rates ranging from 0.5% to 10%. Evaluation metrics include reconstruction error, generalization gap, structure preservation, and uncertainty calibration. Our SVGP-KAN methods achieve reconstruction accuracy comparable to established methods, while also providing well-calibrated uncertainty estimates that reliably indicate when and where predictions degrade. The results demonstrate a robust, data-driven framework for flow field reconstruction with meaningful uncertainty quantification and offer practical guidance for experimental design in periodic flows.",
    "published": "2025-12-27",
    "arxiv_url": "http://arxiv.org/abs/2512.22426v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22426v1",
    "categories": [
      "physics.flu-dyn",
      "cs.LG"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "智能流体力学",
      "机器学习"
    ],
    "keywords": [
      "machine learning",
      "rom",
      "data-driven"
    ]
  },
  {
    "id": "2512.22061v1",
    "title": "Small-scale turbulent dynamo for low-Prandtl number fluid: comparison of the theory with results of numerical simulations",
    "authors": "A. V. Kopyev, A. S. Il'yn, V. A. Sirota, K. P. Zybin",
    "abstract": "Context: During the last decades, significant progress has been made in both numerical simulations of turbulent dynamo and theoretical understanding of turbulence. However, there is still lack of quantitative comparison between the simulations and the theory of the dynamo.   Results: We study the critical magnetic Reynolds number ($Rm_c$) and the growth rate near the threshold both in the limit of very high and in the case of moderate Reynolds numbers. We argue that in Kazantsev equation for magnetic field generation, one should use the quasi-Lagrangian correlator of velocities instead of Eulerian, as usually implied when comparing theory and simulations. The theoretical results obtained with this correlator agree well with numerical results. We also propose the explanation of the decrease of $Rm_c$ as a function of Reynolds number ($Re$) at intermediate-high $Re$. It is probably due to Reynolds-dependent intermittency of the velocity structure function: we show that the scaling exponent of this function in the inertial range affects strongly the magnetic field generation, and it is known to be an increasing function of the Reynolds number.   Conclusions: Use of quasi-Lagrangian correlator in the Kazantsev theory gives good accordance with numerical simulations. An ideal way to compare them should be to find the correlator substituted to the Kazantsev equation and the generation properties in the same simulation. At least one has to use universal parameters independent of the properties of pumping scale. Reynolds-dependent intermittency can explain recently observed decrease of the critical magnetic Reynolds number at small Prandtl numbers.",
    "published": "2025-12-26",
    "arxiv_url": "http://arxiv.org/abs/2512.22061v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22061v1",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.SR"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "流体力学"
    ],
    "keywords": [
      "turbulence"
    ]
  },
  {
    "id": "2512.22300v1",
    "title": "Evaluation of Turbulence Models and Boundary Conditions for Hybrid Ventilation in Reduced-scale Classroom Model",
    "authors": "Deep Narayan Singh, Lagoon Biswal, Girish Naik, Manaswita Bose, Krishnendu Sinha",
    "abstract": "In this paper, we study the ventilation airflow in a model classroom, where exhaust fans throw out the used air, to replace it with outdoor air through open door. Hybrid ventilation, or mechanically assisted natural ventilation, of this kind is used as a retrofit design to reduce infection risk from airborne transmission. The air stream entering the door forms a jet-like flow, driven by the suction effect of exhaust fans. We compute the jet velocity using Reynolds averaged Navier Stokes (RANS) method and compare with velocity field measured using particle image velocimetry. Different turbulence models are found to match experimental data near the door, but they over-predict the peak jet velocity further downstream. There is minimal variation between the results obtained using different turbulence models. The computational results are found to be sensitive to inlet boundary conditions, whether the door entry is specified as a pressure inlet or velocity inlet. The geometry of the space outside the door also has a significant effect on the jet velocity. Changing the boundary condition takes the computational results closer to the experimental data; the velocity profiles computed with the extended domain being the closest to the measured peak velocity. Interestingly, the centerline velocity decay computed with the extended domain aligns well with the experimental data. The other cases, irrespective of turbulence model, show much lower decay rate that seem to align with wall jet scaling. This suggests that geometry and boundary conditions at the door is critical to predict the airflow in hybrid ventilation.",
    "published": "2025-12-26",
    "arxiv_url": "http://arxiv.org/abs/2512.22300v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22300v1",
    "categories": [
      "physics.flu-dyn"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "CFD与机器学习交叉",
      "流体力学"
    ],
    "keywords": [
      "turbulence",
      "rans",
      "rom",
      "les"
    ]
  },
  {
    "id": "2512.21696v1",
    "title": "Enhanced numerical models for two-component fluid flow in multiscale porous structures",
    "authors": "J. Yang, H. Otomo, Hongli Fan, Guangyuan Sun, Rafael Salazar-Tio, Ganapathi Raman Balasubramanian, Ashraful Islam, Bernd Crouse, Raoyang Zhang",
    "abstract": "Multi-component fluid flow simulations in multi-scale porous structures often involve regions that are under-resolved at practical computational resolutions. Accurately capturing the contributions from these unresolved regions is critical. Previous studies proposed a model to account for viscous and capillary forces in under-resolved regions, showing permeability, capillary pressure, and relative permeability comparable to fully resolved high-resolution cases. In this study, we extend the model to handle diverse structures and capture detailed fluid behavior. We introduce controllable surface tension in a pseudo-potential lattice Boltzmann model while keeping interface thickness and spurious currents constant, improving interface dynamics resolution. A method is developed to capture residual fluid components smaller than cell size using local constitutive relations, including absolute and relative permeability and capillary pressure curves. Additionally, a tensorial resistivity model is implemented for heterogeneous structures such as fiber bundles, aligning resistivity along principal axes determined from the Hessian and gradient of local porosity fields. Benchmark tests, including practical rock geometries, validate these enhancements, demonstrating improved transient interface dynamics, accurate capture of irreducible fluid components, and correct directional effects in under-resolved structures.",
    "published": "2025-12-25",
    "arxiv_url": "http://arxiv.org/abs/2512.21696v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21696v1",
    "categories": [
      "physics.flu-dyn",
      "physics.comp-ph"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "流体力学"
    ],
    "keywords": [
      "flow simulation",
      "rans",
      "rom",
      "les"
    ]
  },
  {
    "id": "2512.21614v1",
    "title": "LSTM-PINN: An Hybrid Method for Prediction of Steady-State Electrohydrodynamic Flow",
    "authors": "Ze Tao, Ke Xu, Fujun Liu",
    "abstract": "Physics-Informed Neural Networks (PINNs) have demonstrated considerable success in solving complex fluid dynamics problems. However, their performance often deteriorates in regimes characterized by steep gradients, intricate boundary conditions, and stringent physical constraints, leading to convergence failures and numerical instabilities. To overcome these limitations, we propose a hybrid framework that integrates Long Short-Term Memory (LSTM) networks into the PINN architecture, enhancing its ability to capture spatial correlations in the steady-state velocity field of a two-dimensional charged fluid under an external electric field. Our results demonstrate that the LSTM-enhanced PINN model significantly outperforms conventional Multilayer Perceptron (MLP)-based PINNs in terms of convergence rate, numerical stability, and predictive accuracy. This innovative approach offers improved computational efficiency and reliability for modeling electrohydrodynamic flows, providing new insights and strategies for applications in microfluidics and nanofluidics.",
    "published": "2025-12-25",
    "arxiv_url": "http://arxiv.org/abs/2512.21614v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21614v1",
    "categories": [
      "physics.flu-dyn",
      "math.AP"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "CFD与机器学习交叉",
      "智能流体力学",
      "机器学习",
      "流体力学"
    ],
    "keywords": [
      "pinn",
      "neural network",
      "lstm",
      "physics-informed neural network",
      "fluid dynamics"
    ]
  },
  {
    "id": "2512.21042v1",
    "title": "Passive scalar cascade in the intermediate layer of turbulent channel flow for $Pr\\leq 1$",
    "authors": "Emanuele Gallorini, Shingo Motoki, Genta Kawahara, Christos Vassilicos",
    "abstract": "Similarities and differences between Kolmogorov scale-by-scale equilibria/non-equilibria for velocity and scalar fields are investigated in the intermediate layer of a fully developed turbulent channel flow with a passive scalar/temperature field driven by a uniform heat source. The analysis is based on intermediate asymptotics and direct numerical simulations at different Prandtl numbers lower than unity. Similarly to what happens to the velocity fluctuations, for the fluctuating scalar field Kolmogorov scale-by-scale equilibrium is achieved asymptotically around a length scale $r_{min}$, which is located below the inertial range. The lengthscale $r_{min}$ and the ratio between the inter-scale transfer and dissipation rates at $r_{min}$ vary following power laws of the Prandtl number, with exponents determined by matched asymptotics based on the hypothesis of homogeneous two-point physics in non-homogeneous turbulence. The interscale transfer rates of turbulent kinetic energy and passive scalar variance are globally similar but show evident differences when their aligned/anti-aligned contributions are considered.",
    "published": "2025-12-24",
    "arxiv_url": "http://arxiv.org/abs/2512.21042v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21042v1",
    "categories": [
      "physics.flu-dyn"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "流体力学"
    ],
    "keywords": [
      "turbulence",
      "rans"
    ]
  },
  {
    "id": "2512.20941v1",
    "title": "A Multi-fidelity Double-Delta Wing Dataset and Empirical Scaling Laws for GNN-based Aerodynamic Field Surrogate",
    "authors": "Yiren Shen, Juan J. Alonso",
    "abstract": "Data-driven surrogate models are increasingly adopted to accelerate vehicle design. However, open-source multi-fidelity datasets and empirical guidelines linking dataset size to model performance remain limited. This study investigates the relationship between training data size and prediction accuracy for a graph neural network (GNN) based surrogate model for aerodynamic field prediction. We release an open-source, multi-fidelity aerodynamic dataset for double-delta wings, comprising 2448 flow snapshots across 272 geometries evaluated at angles of attack from 11 (degree) to 19 (degree) at Ma=0.3 using both Vortex Lattice Method (VLM) and Reynolds-Averaged Navier-Stokes (RANS) solvers. The geometries are generated using a nested Saltelli sampling scheme to support future dataset expansion and variance-based sensitivity analysis. Using this dataset, we conduct a preliminary empirical scaling study of the MF-VortexNet surrogate by constructing six training datasets with sizes ranging from 40 to 1280 snapshots and training models with 0.1 to 2.4 million parameters under a fixed training budget. We find that the test error decreases with data size with a power-law exponent of -0.6122, indicating efficient data utilization. Based on this scaling law, we estimate that the optimal sampling density is approximately eight samples per dimension in a d-dimensional design space. The results also suggest improved data utilization efficiency for larger surrogate models, implying a potential trade-off between dataset generation cost and model training budget.",
    "published": "2025-12-24",
    "arxiv_url": "http://arxiv.org/abs/2512.20941v1",
    "pdf_url": "https://arxiv.org/pdf/2512.20941v1",
    "categories": [
      "cs.LG",
      "cs.AI",
      "physics.flu-dyn"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "机器学习"
    ],
    "keywords": [
      "rans",
      "rom",
      "neural network",
      "data-driven",
      "surrogate model",
      "les"
    ]
  },
  {
    "id": "2512.20894v1",
    "title": "Geese achieve stationary takeoff via synergistic wing kinematics and enhanced aerodynamics",
    "authors": "Jinpeng Huang, Yang Xiang, Lunbing Chen, Suyang Qin, Jixin Lu, Sen Ye, Yong Chen, Hong Liu",
    "abstract": "Stationary take-off, without a running start or elevated descent, requires substantial aerodynamic forces to overcome weight, particularly for large birds such as geese exceeding 2 kg. However, the complex wing motion and high-Reynolds-number (Re $\\approx$$10^5$) flow dynamics challenge conventional expectations of avian flight aerodynamics, rendering this mechanism elusive. Analyzing 578 stationary take-offs from seven geese (\\textit{Anser cygnoides}) and applying Principal Component Analysis (PCA), we reveal that the complex wing kinematics collapse onto a low-dimensional manifold dominated by two synergies: a Stroke Synergy responsible for fundamental rhythmic stroke, and a Morphing Synergy governing spanwise geometry. This modular control strategy orchestrates a stereotyped wing kinematics featuring an accelerated translational downstroke and a rapid tip-reversal upstroke. By integrating wing kinematic analysis with the mass distribution of the geese, we quantified the aerodynamic forces and found that entirely positive lift and thrust are generated throughout the motion cycle. The enhanced aerodynamic performance of geese takeoff results from three principal mechanisms. During the downstroke, significant lift generated from wing acceleration is predicted by the quasi-steady framework. Flow visualization reveals that wake capture further enhances the lift generation in downstroke by orienting the position of wake vortices. During the upstroke, the distal wing performs a rapid pitching motion and generates a substantial thrust, the vertical component of which contributes significantly to weight support.",
    "published": "2025-12-24",
    "arxiv_url": "http://arxiv.org/abs/2512.20894v1",
    "pdf_url": "https://arxiv.org/pdf/2512.20894v1",
    "categories": [
      "physics.flu-dyn",
      "physics.bio-ph"
    ],
    "conference": "",
    "code_link": "",
    "tags": [
      "CFD与机器学习交叉",
      "流体力学",
      "空气动力学"
    ],
    "keywords": [
      "rans",
      "rom",
      "aerodynamics"
    ]
  }
]